Revit 2027 API
ParameterFilterRuleFactory.CreateGreaterRule(ElementId, Int32) Method
 Creates a filter rule that determines whether integer values from the document are greater than a certain value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateGreaterRule(
	ElementId parameter,
	int value
)
Public Shared Function CreateGreaterRule (
	parameter As ElementId,
	value As Integer
) As FilterRule
public:
static FilterRule^ CreateGreaterRule(
	ElementId^ parameter,
	int value
)
static member CreateGreaterRule :
        parameter : ElementId *
        value : int -> FilterRule
Parameters
parameter ElementId
 An integer-typed parameter used to get values from the document for a given element.
value Int32
 The user-supplied value against which values from the document will be compared.
Return Value
FilterRule
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterRuleFactory Class
CreateGreaterRule Overload
Autodesk.Revit.DB Namespace